function MC_Square
% SIRS model on a square grate, the kinetic method of MonteCarlo
%==========================================================================

% Global parameters
%**************************************************************************
global k1 k2 k3 d1 d2
global Nx Ny N
global x0 y0 RandSeed  N1ini N2ini
global Latt Nei
global class_MC number_class_MC
global t0 t1
%**************************************************************************
% Speed value
k1 = 1.0;
k2 = 2.0;
k3 = 3.0;

d1 = 4.0;
d2 = 5.0;

%--------------------------------------------------------------------------
% The sizes of the lattice, total number of nodes (cells) of the lattice
Nx = 10; Ny = 10;
N = Nx * Ny;

% initial concentration of cases (infected)
x0 = 0.2;
if (x0 > 1) 
    x0 = 1; end
% initial concentration of recovered with immunity (recovered)
y0 = 0.5;
if (x0 + y0 > 1)
    y0 = 1 - x0; end

RandSeed = 2;

%--------------------------------------------------------------------------
% Time interval
t0 = 0;
t1 = 1000;

%--------------------------------------------------------------------------
% описание классов для квадратной решётки при трёх состояниях узлов
class_def;

%--------------------------------------------------------------------------
% задание массива Nei - номеров ближайших соседних узлов с учётом
% периодических гр. условий

nei_def;

%--------------------------------------------------------------------------
% начальное состояние поверхности
ini_def;

%--------------------------------------------------------------------------
% визуализация
fig_surf(t0);

%--------------------------------------------------------------------------
% формирование массивов номеров узлов для всех классов 
list_class_def;

%--------------------------------------------------------------------------
% вычисления
% KMC_proc;





















